ORTEChoiceRes/testsuites/RAD_Cancel_Request/03_Cancel_ChaiDan_Agoda_two_roomcount =1 one day/runs/choiceres_rad_cancel_req.xml

<?xml version="1.0" encoding="UTF-8"?>
<soap11:Envelope xmlns="http://www.derbysoft.com/dswitch/rad" xmlns:soap11="http://schemas.xmlsoap.org/soap/envelope/">
	<soap11:Body>
		<ReservationNotificationRequest Token="9D210476-0AAF-4E2F-8634-9F948A4A6995:02">
			<Contract ChannelCode="AGODA" SupplierCode="CHOICE"/>
			<Reservation ReservationId="AGODA000ADCADF97-C710-4B5F-8EF1-7D319A4A5DE9" ChannelReservationId="107464822" Status="cancelled">
				<Hotel Code="US4S97P8VT0"/>
			</Reservation>
		</ReservationNotificationRequest>
	</soap11:Body>
</soap11:Envelope>
